import pygame

# --- Размеры окна ---
WIDTH, HEIGHT = 600, 400
BLOCK_SIZE = 20

# --- Цвета (RGB) ---
WHITE = (255, 255, 255)
BLACK = (0, 0, 0)
RED = (213, 50, 80)          # Обычная еда
DARK_RED = (139, 0, 0)       # Ядовитая еда
GREEN = (0, 255, 0)          # Змея (по умолчанию)
BLUE = (50, 153, 213)        # Фон
GOLD = (255, 215, 0)         # Исчезающая еда
GRID_COLOR = (40, 130, 190)  # Сетка
GRAY = (169, 169, 169)       # Препятствия (стены)

# Цвета бонусов
COLOR_SPEED = (0, 255, 255)  # Голубой
COLOR_SLOW = (255, 165, 0)   # Оранжевый
COLOR_SHIELD = (192, 192, 192) # Серебряный